In [3]:
from config import app_key
import requests
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime

In [4]:
lat = [34.0522,40.7831] 
lon = [-118.2437,-73.9712] 
location_name = ["Los Angeles", "Manhattan"]
start = 1641091892
end = 1643683892

In [17]:
#create empty df to hold data
df_air_pollution = pd.DataFrame()

for la,lo,city in zip(lat,lon,location_name):
    url=f"http://api.openweathermap.org/data/2.5/air_pollution/history?lat={la}&lon={lo}&start={start}&end={end}&appid={app_key}"
    response = requests.get(url)
    print(response.status_code)
    print(response.json()["list"][0])
    list_date = []
    list_co = []
    list_no2=[]
    list_o3=[]
    list_city = []

    for row in response.json()["list"]:
        list_date.append(row['dt']),
        list_co.append(row['components']['co'])
        list_no2.append(row['components']['no2'])
        list_o3.append(row['components']['o3'])
        list_city.append(city)

    temp_df_air_pollution = pd.DataFrame({
    "Date": list_date,
    "CarbonMonoxide":list_co,
    "NitogenDioxide":list_no2,
    "Ozone":list_o3,
    "City":list_city
    })
    df_air_pollution = pd.concat([df_air_pollution, temp_df_air_pollution])

200
{'main': {'aqi': 5}, 'components': {'co': 1949.31, 'no': 193.12, 'no2': 134.35, 'o3': 0, 'so2': 8.34, 'pm2_5': 93.36, 'pm10': 114.49, 'nh3': 14.82}, 'dt': 1641092400}
200
{'main': {'aqi': 5}, 'components': {'co': 1361.85, 'no': 168.09, 'no2': 35.3, 'o3': 0, 'so2': 6.85, 'pm2_5': 54.26, 'pm10': 59.04, 'nh3': 2.69}, 'dt': 1641092400}

In [18]:
df_air_pollution

           Date  CarbonMonoxide  NitogenDioxide  Ozone         City
0    1641092400         1949.31          134.35   0.00  Los Angeles
1    1641096000         2189.64          128.87   0.00  Los Angeles
2    1641099600         2029.42          102.82   0.00  Los Angeles
3    1641103200         1668.93           82.25   0.00  Los Angeles
4    1641106800         1321.79           70.60   0.00  Los Angeles
..          ...             ...             ...    ...          ...
691  1643666400         2830.51          233.05   5.19    Manhattan
692  1643670000         2723.69          186.44   0.01    Manhattan
693  1643673600         2643.59          143.95   0.00    Manhattan
694  1643677200         2403.26          112.41   0.00    Manhattan
695  1643680800         2162.93           98.71   0.00    Manhattan

[1392 rows x 5 columns]

In [19]:
df_air_pollution["Date_Time"] = pd.to_datetime(df_air_pollution['Date'], unit='s')

In [20]:
df_air_pollution

,Date,CarbonMonoxide,NitogenDioxide,Ozone,City,Date_Time
0,1641092400,1949.31,134.35,0.00,Los Angeles,2022-01-02 03:00:00
1,1641096000,2189.64,128.87,0.00,Los Angeles,2022-01-02 04:00:00
2,1641099600,2029.42,102.82,0.00,Los Angeles,2022-01-02 05:00:00
3,1641103200,1668.93,82.25,0.00,Los Angeles,2022-01-02 06:00:00
4,1641106800,1321.79,70.60,0.00,Los Angeles,2022-01-02 07:00:00
...,...,...,...,...,...,...
691,1643666400,2830.51,233.05,5.19,Manhattan,2022-01-31 22:00:00
692,1643670000,2723.69,186.44,0.01,Manhattan,2022-01-31 23:00:00
693,1643673600,2643.59,143.95,0.00,Manhattan,2022-02-01 00:00:00
694,1643677200,2403.26,112.41,0.00,Manhattan,2022-02-01 01:00:00
695,1643680800,2162.93,98.71,0.00,Manhattan,2022-02-01 02:00:00

In [21]:
# df_air_pollution.to_csv("file.csv")
engine = create_engine('postgresql://postgres:postgres@localhost:5432/air_pollution')

In [22]:
df_air_pollution.to_sql('air_pollution_forecast', engine, if_exists='replace',index=False) #drops old table and creates new empty table